spec/fixtures/files/stripe/successful_card/checkout.session.completed.json

{
  "id": "cs_test_b1t9UciiVTttpBTqI400epC3Lj2atLuThMXsuRhGyBlQeJMSky0GMChLXG",
  "object": "checkout.session",
  "after_expiration": null,
  "allow_promotion_codes": null,
  "amount_subtotal": 280000,
  "amount_total": 280000,
  "automatic_tax": { "enabled": false, "status": null },
  "billing_address_collection": null,
  "cancel_url": "http://localhost:3000/stripe/payment_cancel",
  "client_reference_id": "cef4da60-ab76-4968-bec5-17c6b03aa3a0",
  "consent": null,
  "consent_collection": null,
  "created": 1672667688,
  "currency": "twd",
  "custom_text": { "shipping_address": null, "submit": null },
  "customer": "cus_N5zxtved7o3FPc",
  "customer_creation": null,
  "customer_details": {
    "address": {
      "city": null,
      "country": "TW",
      "line1": null,
      "line2": null,
      "postal_code": null,
      "state": null
    },
    "email": "admin@gmail.com",
    "name": "test",
    "phone": null,
    "tax_exempt": "none",
    "tax_ids": []
  },
  "customer_email": null,
  "expires_at": 1672754088,
  "invoice": null,
  "invoice_creation": {
    "enabled": false,
    "invoice_data": {
      "account_tax_ids": null,
      "custom_fields": null,
      "description": null,
      "footer": null,
      "metadata": {},
      "rendering_options": null
    }
  },
  "livemode": false,
  "locale": null,
  "metadata": {},
  "mode": "payment",
  "payment_intent": "pi_3MLoTUFUSUvjNxGl2jjXpR4N",
  "payment_link": null,
  "payment_method_collection": "always",
  "payment_method_options": {},
  "payment_method_types": ["card"],
  "payment_status": "paid",
  "phone_number_collection": { "enabled": false },
  "recovered_from": null,
  "setup_intent": null,
  "shipping": null,
  "shipping_address_collection": null,
  "shipping_options": [],
  "shipping_rate": null,
  "status": "complete",
  "submit_type": null,
  "subscription": null,
  "success_url": "http://localhost:3000/stripe/payment_success",
  "total_details": {
    "amount_discount": 0,
    "amount_shipping": 0,
    "amount_tax": 0
  },
  "url": null
}
